OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Inc/py32f4xx_ll_sdmmc.h
 /** @defgroup SDMMC_LL_ERROR_STATUS Masks for errors Card Status R1
   * @brief  Masks for errors Card Status R1 (OCR Register)  
  * @{
  */
#define SDMMC_OCR_ADDR_OUT_OF_RANGE        ((uint32_t)0x80000000U)
#define SDMMC_OCR_ADDR_MISALIGNED          ((uint32_t)0x40000000U)
#define SDMMC_OCR_BLOCK_LEN_ERR            ((uint32_t)0x20000000U)
#define SDMMC_OCR_ERASE_SEQ_ERR            ((uint32_t)0x10000000U)
#define SDMMC_OCR_BAD_ERASE_PARAM          ((uint32_t)0x08000000U)
#define SDMMC_OCR_WRITE_PROT_VIOLATION     ((uint32_t)0x04000000U)
#define SDMMC_OCR_LOCK_UNLOCK_FAILED       ((uint32_t)0x01000000U)
#define SDMMC_OCR_COM_CRC_FAILED           ((uint32_t)0x00800000U)
#define SDMMC_OCR_ILLEGAL_CMD              ((uint32_t)0x00400000U)
#define SDMMC_OCR_CARD_ECC_FAILED          ((uint32_t)0x00200000U)
#define SDMMC_OCR_CC_ERROR                 ((uint32_t)0x00100000U)
#define SDMMC_OCR_GENERAL_UNKNOWN_ERROR    ((uint32_t)0x00080000U)
#define SDMMC_OCR_STREAM_READ_UNDERRUN     ((uint32_t)0x00040000U)
#define SDMMC_OCR_STREAM_WRITE_OVERRUN     ((uint32_t)0x00020000U)
#define SDMMC_OCR_CID_CSD_OVERWRITE        ((uint32_t)0x00010000U)
#define SDMMC_OCR_WP_ERASE_SKIP            ((uint32_t)0x00008000U)
#define SDMMC_OCR_CARD_ECC_DISABLED        ((uint32_t)0x00004000U)
#define SDMMC_OCR_ERASE_RESET              ((uint32_t)0x00002000U)
#define SDMMC_OCR_AKE_SEQ_ERROR            ((uint32_t)0x00000008U)
#define SDMMC_OCR_ERRORBITS                ((uint32_t)0xFDFFE008U)
/**
  * @}
  */

 /** @defgroup SDMMC_LL_RESPONSE Masks for R6 Response
  * @{
  */
#define SDMMC_R6_GENERAL_UNKNOWN_ERROR     ((uint32_t)0x00002000U)
#define SDMMC_R6_ILLEGAL_CMD               ((uint32_t)0x00004000U)
#define SDMMC_R6_COM_CRC_FAILED            ((uint32_t)0x00008000U)

#define SDMMC_VOLTAGE_WINDOW_SD            ((uint32_t)0x80100000U)
#define SDMMC_HIGH_CAPACITY                ((uint32_t)0x40000000U)
#define SDMMC_STD_CAPACITY                 ((uint32_t)0x00000000U)
#define SDMMC_CHECK_PATTERN                ((uint32_t)0x000001AAU)
#define SD_SWITCH_1_8V_CAPACITY            ((uint32_t)0x01000000U)

#define SDMMC_MAX_VOLT_TRIAL               ((uint32_t)0x0000FFFFU)

#define SDMMC_MAX_TRIAL                    ((uint32_t)0x0000FFFFU)

#define SDMMC_ALLZERO                      ((uint32_t)0x00000000U)

#define SDMMC_WIDE_BUS_SUPPORT             ((uint32_t)0x00040000U)
#define SDMMC_SINGLE_BUS_SUPPORT           ((uint32_t)0x00010000U)
#define SDMMC_CARD_LOCKED                  ((uint32_t)0x02000000U)

#define SDMMC_DATATIMEOUT                  ((uint32_t)0xFFFFFFFFU)

#define SDMMC_0TO7BITS                     ((uint32_t)0x000000FFU)
#define SDMMC_8TO15BITS                    ((uint32_t)0x0000FF00U)
#define SDMMC_16TO23BITS                   ((uint32_t)0x00FF0000U)
#define SDMMC_24TO31BITS                   ((uint32_t)0xFF000000U)
#define SDMMC_MAX_DATA_LENGTH              ((uint32_t)0x01FFFFFFU)

#define SDMMC_HALFFIFO                     ((uint32_t)0x00000008U)
#define SDMMC_HALFFIFOBYTES                ((uint32_t)0x00000020U)
/**
  * @}
  */

 /** @defgroup SDMMC_LL_CMD_CLASS Command Class supported
  * @{
  */
#define SDIO_CCCC_ERASE                   ((uint32_t)0x00000020U)

#define SDIO_CMDTIMEOUT                   ((uint32_t)5000U)        /* Command send and response timeout */
#define SDIO_MAXERASETIMEOUT              ((uint32_t)63000U)       /* Max erase Timeout 63 s            */
#define SDIO_STOPTRANSFERTIMEOUT          ((uint32_t)100000000U)   /* Timeout for STOP TRANSMISSION command */
/**
  * @}
  */

/** @defgroup SDIO_LL_Clock_Select Clock select
  * @{
  */
#define SDIO_CLOCK_OFFSET_90C              ((uint32_t)0x00000000U)
#define SDIO_CLOCK_OFFSET_180C             SDIO_CLKCR_CKSEL

#define IS_SDIO_CLOCK_SEL(CLKSEL)          (((CLKSEL) == SDIO_CLOCK_OFFSET_90C) || \
                                            ((CLKSEL) == SDIO_CLOCK_OFFSET_180C))
/**
  * @}
  */

/** @defgroup SDIO_LL_PreSampling PreSampling clock
  * @{
  */
#define SDIO_PRE_SAMPLING_DISABLE          ((uint32_t)0x00000000U)
#define SDIO_PRE_SAMPLING_ENABLE           SDIO_CLKCR_SMPEN   

#define IS_SDIO_PRE_SAMPLING(SMPEN)        (((SMPEN) == SDIO_PRE_SAMPLING_DISABLE) || \
                                            ((SMPEN) == SDIO_PRE_SAMPLING_ENABLE))
/**
  * @}
  */ 

/** @defgroup SDIO_LL_PreSampling_Clock_Select Hardware Flow Control
  * @{
  */
#define SDIO_PRE_SAMPLING_CLOCK_OFFSET_NONE     ((uint32_t)0x00000000U)
#define SDIO_PRE_SAMPLING_CLOCK_OFFSET_270C     SDIO_CLKCR_SMPCLKSEL

#define IS_SDIO_PRE_SAMPLING_CLOCK(CONTROL)     (((CONTROL) == SDIO_PRE_SAMPLING_CLOCK_OFFSET_NONE) || \
                                                 ((CONTROL) == SDIO_PRE_SAMPLING_CLOCK_OFFSET_270C))
/**
  * @}
  */

/** @defgroup SDIO_LL_Clock_Power_Save Clock Power Saving
  * @{
  */
#define SDIO_CLOCK_POWER_SAVE_DISABLE      ((uint32_t)0x00000000U)
#define SDIO_CLOCK_POWER_SAVE_ENABLE       SDIO_CLKCR_PWRSAV

#define IS_SDIO_CLOCK_POWER_SAVE(SAVE)     (((SAVE) == SDIO_CLOCK_POWER_SAVE_DISABLE) || \
                                            ((SAVE) == SDIO_CLOCK_POWER_SAVE_ENABLE))
/**
  * @}
  */

/** @defgroup SDIO_LL_Bus_Wide Bus Width
  * @{
  */
#define SDIO_BUS_WIDE_1B                   ((uint32_t)0x00000000U)
#define SDIO_BUS_WIDE_4B                   SDIO_CLKCR_WIDBUS_0
#define SDIO_BUS_WIDE_8B                   SDIO_CLKCR_WIDBUS_1

#define IS_SDIO_BUS_WIDE(WIDE)             (((WIDE) == SDIO_BUS_WIDE_1B) || \
                                            ((WIDE) == SDIO_BUS_WIDE_4B) || \
                                            ((WIDE) == SDIO_BUS_WIDE_8B))
/**
  * @}
  */
  
/** @defgroup SDIO_LL_Clock_Division Clock Division
  * @{
  */
#define IS_SDIO_CLKDIV(DIV)   ((DIV) <= 0xFFU)
/**
  * @}
  */  
    
/** @defgroup SDIO_LL_Command_Index Command Index
  * @{
  */
#define IS_SDIO_CMD_INDEX(INDEX)            ((INDEX) < 0x40U)
/**
  * @}
  */

/** @defgroup SDIO_LL_Response_Type Response Type
  * @{
  */
#define SDIO_RESPONSE_NO                    ((uint32_t)0x00000000U)
#define SDIO_RESPONSE_SHORT                 SDIO_CMD_WAITRESP
#define SDIO_RESPONSE_LONG                  (SDIO_CMD_WAITRESP | SDIO_CMD_RESPLEN)

