OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Inc/py32f4xx_ll_sdmmc.h
#define SDIO_STATIC_CMD_FLAGS               ((uint32_t)(SDIO_FLAG_CAD | SDIO_FLAG_RE | SDIO_FLAG_CD |\
                                                        SDIO_FLAG_RCRC | SDIO_FLAG_RTO_BAR | SDIO_FLAG_HTO |\
																												SDIO_FLAG_HLE | SDIO_FLAG_SBE | SDIO_FLAG_ACD))

#define SDIO_STATIC_DATA_FLAGS              ((uint32_t)(SDIO_FLAG_DTO | SDIO_FLAG_TXDR | SDIO_FLAG_DCRC |\
                                                        SDIO_FLAG_DRTO_BDS | SDIO_FLAG_HTO | SDIO_FLAG_FRUN |\
																											  SDIO_FLAG_HLE | SDIO_FLAG_SBE | SDIO_FLAG_EBE))
/**
  * @}
  */

/**
  * @}
  */
  
/* Exported macro ------------------------------------------------------------*/
/** @defgroup SDMMC_LL_Exported_macros SDMMC Exported Macros
  * @{
  */

/** @defgroup SDMMC_LL_Register Bits And Addresses Definitions
  * @brief SDMMC_LL registers bit address in the alias region
  * @{
  */
/* ---------------------- SDIO registers bit mask --------------------------- */
/* --- CLKCR Register ---*/
/* CLKCR register clear mask */ 
#define CLKCR_CLEAR_MASK         ((uint32_t)(SDIO_CLKCR_CLKDIV  | SDIO_CLKCR_PWRSAV |\
                                             SDIO_CLKCR_CKSEL   | SDIO_CLKCR_WIDBUS |\
                                             SDIO_CLKCR_SMPEN   | SDIO_CLKCR_SMPCLKSEL))

///* --- DCTRL Register ---*/
///* SDIO DCTRL Clear Mask */
//#define DCTRL_CLEAR_MASK         ((uint32_t)(SDIO_DCTRL_DTEN    | SDIO_DCTRL_DTDIR |\
//                                             SDIO_DCTRL_DTMODE  | SDIO_DCTRL_DBLOCKSIZE))

/* --- CMD Register ---*/
/* CMD Register clear mask */
#define CMD_CLEAR_MASK           ((uint32_t)(SDIO_CMD_CMDINDEX_Msk | SDIO_CMD_WAITRESP_Msk |\
                                             SDIO_CMD_RESPLEN_Msk  | SDIO_CMD_CHECKRESPCRC_Msk |\
																						 SDIO_CMD_DEXPECT_Msk  | SDIO_CMD_WAITPEND_Msk |\
                                             SDIO_CMD_STARTCMD_Msk | SDIO_CMD_AUTOINIT_Msk |\
																						 SDIO_CMD_REGSYNC_Msk))

/* SDIO Initialization Frequency (400KHz max) */
#define SDIO_INIT_CLK_DIV     (SystemCoreClock/(400000<<1))   /* SystemCoreClock / (SDMMC_INIT_CLK_DIV * 2) < 400KHz */

/* SDIO Data Transfer Frequency (25MHz max) */
#define SDIO_TRANSFER_CLK_DIV ((uint8_t)0x5)
/**
  * @}
  */

/** @defgroup SDMMC_LL_Interrupt_Clock Interrupt And Clock Configuration
 *  @brief macros to handle interrupts and specific clock configurations
 * @{
 */
 
/**
  * @brief  Enable the SDIO device.
  * @param  __INSTANCE__: SDIO Instance  
  * @retval None
  */
#define __SDIO_ENABLE(__INSTANCE__)  SET_BIT((__INSTANCE__)->CLKCR, SDIO_CLKCR_CLKEN)

/**
  * @brief  Disable the SDIO device.
  * @param  __INSTANCE__: SDIO Instance  
  * @retval None
  */
#define __SDIO_DISABLE(__INSTANCE__)  CLEAR_BIT((__INSTANCE__)->CLKCR, SDIO_CLKCR_CLKEN)

/**
  * @brief  Enable the SDIO DMA transfer.
  * @param  __INSTANCE__: SDIO Instance  
  * @retval None
  */
#define __SDIO_DMA_ENABLE(__INSTANCE__)  SET_BIT((__INSTANCE__)->CTRL, SDIO_CTRL_DMAEN)

/**
  * @brief  Disable the SDIO DMA transfer.
  * @param  __INSTANCE__: SDIO Instance   
  * @retval None
  */
#define __SDIO_DMA_DISABLE(__INSTANCE__)  CLEAR_BIT((__INSTANCE__)->CTRL, SDIO_CTRL_DMAEN)

/**
  * @brief  Enable the SDIO auto send stop command.
  * @param  __INSTANCE__: SDIO Instance  
  * @retval None
  */
#define __SDIO_AUTO_STOP_CMD_ENABLE(__INSTANCE__)  SET_BIT((__INSTANCE__)->CMD, SDIO_CMD_AUTOSTOP)

/**
  * @brief  Disable the SDIO auto send stop command.
  * @param  __INSTANCE__: SDIO Instance  
  * @retval None
  */
#define __SDIO_AUTO_STOP_CMD_DISABLE(__INSTANCE__)  CLEAR_BIT((__INSTANCE__)->CMD, SDIO_CMD_AUTOSTOP)

/**
  * @brief  Whether AutoStop is enable.
  * @param  __INSTANCE__: SDIO Instance   
  * @retval None
  */
#define __SDIO_IS_ENABLE_AUTO_STOP(__INSTANCE__)  (((__INSTANCE__)->CMD & SDIO_CMD_AUTOSTOP) == SDIO_CMD_AUTOSTOP)

/**
  * @brief  Whether card is busy.
  * @param  __INSTANCE__: SDIO Instance   
  * @retval None
  */
#define __SDIO_IS_CARD_BUSY(__INSTANCE__)  (((__INSTANCE__)->STATUS & SDIO_STATUS_CARDBSY) == SDIO_STATUS_CARDBSY)

/**
  * @brief  Whether FIFO is empty.
  * @param  __INSTANCE__: SDIO Instance   
  * @retval None
  */
#define __SDIO_IS_FIFO_EMPTY(__INSTANCE__)  (((__INSTANCE__)->STATUS & SDIO_STATUS_FIFOE) == SDIO_STATUS_FIFOE)

/**
  * @brief  Whether FIFO is full.
  * @param  __INSTANCE__: SDIO Instance   
  * @retval None
  */
#define __SDIO_IS_FIFO_FULL(__INSTANCE__)  (((__INSTANCE__)->STATUS & SDIO_STATUS_FIFOF) == SDIO_STATUS_FIFOF)

///**
//  * @brief  Whether the recieved data reached the watermark.
//  * @param  __INSTANCE__: SDIO Instance   
//  * @retval None
//  */
//#define __SDIO_IS_RX_WATERMARK(__INSTANCE__)  (((__INSTANCE__)->STATUS & SDIO_STATUS_RXWMARK) == SDIO_STATUS_RXWMARK)

///**
//  * @brief  Whether the transferred data reached the watermark.
//  * @param  __INSTANCE__: SDIO Instance   
//  * @retval None
//  */
//#define __SDIO_IS_TX_WATERMARK(__INSTANCE__)  (((__INSTANCE__)->STATUS & SDIO_STATUS_TXWMARK) == SDIO_STATUS_TXWMARK)

/**
  * @brief  Enable SDIO global interrupt.
  * @param  __INSTANCE__: SDIO Instance   
  * @retval None
  */
#define __SDIO_ENABLE_GLOBAL_IT(__INSTANCE__)  SET_BIT((__INSTANCE__)->CTRL, SDIO_CTRL_INTEN)

/**
  * @brief  Disable SDIO global interrupt.
  * @param  __INSTANCE__: SDIO Instance   
  * @retval None
  */
#define __SDIO_DISABLE_GLOBAL_IT(__INSTANCE__)  CLEAR_BIT((__INSTANCE__)->CTRL, SDIO_CTRL_INTEN)

/**
  * @brief  Enable the SDIO device interrupt.
  * @param  __INSTANCE__ : Pointer to SDIO register base  
  * @param  __INTERRUPT__ : specifies the SDIO interrupt sources to be enabled.
  *         This parameter can be one or a combination of the following values:
  *            @arg SDIO_IT_CAD:      Card detect interrupt
  *            @arg SDIO_IT_RE:       Response error interrupt
  *            @arg SDIO_IT_CD:       Command completion interrupt
  *            @arg SDIO_IT_DTO:      Data transfer completion interrupt
  *            @arg SDIO_IT_TXDR:     Transmit FIFO request interrupt
  *            @arg SDIO_IT_RXDR:     Received FIFO request interrupt
  *            @arg SDIO_IT_RCRC:     Command response CRC check error interrupt
  *            @arg SDIO_IT_DCRC:     Data CRC check error interrupt
  *            @arg SDIO_IT_RTO_BAR:  Command response timeout interrupt
  *            @arg SDIO_IT_DRTO_BDS: Data timeout interrupt
  *            @arg SDIO_IT_HTO:      Host timeout interrupt
  *            @arg SDIO_IT_FRUN:     FIFO underrun interrupt
  *            @arg SDIO_IT_HLE:      Hardware lock write interrupt
  *            @arg SDIO_IT_SBE:      Start bit error interrupt
  *            @arg SDIO_IT_ACD:      Automatic command completion interrupt
  *            @arg SDIO_IT_EBE:      End bit error interrupt
  *            @arg SDIO_IT_SDIOINT:  Detect SDIO card interrupt
  * @retval None
  */
#define __SDIO_ENABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->INTMASK |= (__INTERRUPT__))

/**
  * @brief  Disable the SDIO device interrupt.
  * @param  __INSTANCE__ : Pointer to SDIO register base   
  * @param  __INTERRUPT__ : specifies the SDIO interrupt sources to be disabled.
  *          This parameter can be one or a combination of the following values:
  *            @arg SDIO_IT_CAD:      Card detect interrupt
  *            @arg SDIO_IT_RE:       Response error interrupt
  *            @arg SDIO_IT_CD:       Command completion interrupt
  *            @arg SDIO_IT_DTO:      Data transfer completion interrupt
  *            @arg SDIO_IT_TXDR:     Transmit FIFO request interrupt
  *            @arg SDIO_IT_RXDR:     Received FIFO request interrupt
  *            @arg SDIO_IT_RCRC:     Command response CRC check error interrupt
  *            @arg SDIO_IT_DCRC:     Data CRC check error interrupt
  *            @arg SDIO_IT_RTO_BAR:  Command response timeout interrupt
  *            @arg SDIO_IT_DRTO_BDS: Data timeout interrupt
  *            @arg SDIO_IT_HTO:      Host timeout interrupt
  *            @arg SDIO_IT_FRUN:     FIFO underrun interrupt
  *            @arg SDIO_IT_HLE:      Hardware lock write interrupt
  *            @arg SDIO_IT_SBE:      Start bit error interrupt
  *            @arg SDIO_IT_ACD:      Automatic command completion interrupt
  *            @arg SDIO_IT_EBE:      End bit error interrupt
  *            @arg SDIO_IT_SDIOINT:  Detect SDIO card interrupt
  * @retval None
  */
#define __SDIO_DISABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->INTMASK &= ~(__INTERRUPT__))

/**
  * @brief  Checks whether the specified SDIO flag is set or not. 
  * @param  __INSTANCE__ : Pointer to SDIO register base   
  * @param  __FLAG__: specifies the flag to check. 
  *          This parameter can be one of the following values:
  *            @arg SDIO_FLAG_CAD:      Card detect interrupt
  *            @arg SDIO_FLAG_RE:       Response error interrupt
  *            @arg SDIO_FLAG_CD:       Command completion interrupt
  *            @arg SDIO_FLAG_DTO:      Data transfer completion interrupt
  *            @arg SDIO_FLAG_TXDR:     Transmit FIFO request interrupt
  *            @arg SDIO_FLAG_RXDR:     Received FIFO request interrupt
  *            @arg SDIO_FLAG_RCRC:     Command response CRC check error interrupt
  *            @arg SDIO_FLAG_DCRC:     Data CRC check error interrupt
  *            @arg SDIO_FLAG_RTO_BAR:  Command response timeout interrupt
  *            @arg SDIO_FLAG_DRTO_BDS: Data timeout interrupt
  *            @arg SDIO_FLAG_HTO:      Host timeout interrupt
  *            @arg SDIO_FLAG_FRUN:     FIFO underrun interrupt
  *            @arg SDIO_FLAG_HLE:      Hardware lock write interrupt
  *            @arg SDIO_FLAG_SBE:      Start bit error interrupt
  *            @arg SDIO_FLAG_ACD:      Automatic command completion interrupt
  *            @arg SDIO_FLAG_EBE:      End bit error interrupt
  *            @arg SDIO_FLAG_SDIOINT:  Detect SDIO card interrupt
  * @retval The new state of SDIO_FLAG (SET or RESET).
  */
#define __SDIO_GET_FLAG(__INSTANCE__, __FLAG__)  (((__INSTANCE__)->INTSTS &(__FLAG__)) != 0U)


/**
  * @brief  Clears the SDIO specified flags.
  * @param  __INSTANCE__ : Pointer to SDIO register base  
  * @param  __FLAG__: specifies the flag to clear.  
  *          This parameter can be one or a combination of the following values:
  *            @arg SDIO_FLAG_CAD:      Card detect interrupt
  *            @arg SDIO_FLAG_RE:       Response error interrupt
  *            @arg SDIO_FLAG_CD:       Command completion interrupt
  *            @arg SDIO_FLAG_DTO:      Data transfer completion interrupt
  *            @arg SDIO_FLAG_TXDR:     Transmit FIFO request interrupt
  *            @arg SDIO_FLAG_RXDR:     Received FIFO request interrupt
  *            @arg SDIO_FLAG_RCRC:     Command response CRC check error interrupt
  *            @arg SDIO_FLAG_DCRC:     Data CRC check error interrupt
  *            @arg SDIO_FLAG_RTO_BAR:  Command response timeout interrupt
  *            @arg SDIO_FLAG_DRTO_BDS: Data timeout interrupt
  *            @arg SDIO_FLAG_HTO:      Host timeout interrupt
  *            @arg SDIO_FLAG_FRUN:     FIFO underrun interrupt
  *            @arg SDIO_FLAG_HLE:      Hardware lock write interrupt
  *            @arg SDIO_FLAG_SBE:      Start bit error interrupt
  *            @arg SDIO_FLAG_ACD:      Automatic command completion interrupt
  *            @arg SDIO_FLAG_EBE:      End bit error interrupt
  *            @arg SDIO_FLAG_SDIOINT:  Detect SDIO card interrupt
  * @retval None
  */
#define __SDIO_CLEAR_FLAG(__INSTANCE__, __FLAG__)  ((__INSTANCE__)->INTSTS = (__FLAG__))

/**
  * @brief  Checks whether the specified SDIO interrupt has occurred or not.
  * @param  __INSTANCE__ : Pointer to SDIO register base   
  * @param  __INTERRUPT__: specifies the SDIO interrupt source to check. 
  *          This parameter can be one of the following values:
  *            @arg SDIO_IT_CCRCFAIL: Command response received (CRC check failed) interrupt
  *            @arg SDIO_IT_DCRCFAIL: Data block sent/received (CRC check failed) interrupt
  *            @arg SDIO_IT_CTIMEOUT: Command response timeout interrupt
  *            @arg SDIO_IT_DTIMEOUT: Data timeout interrupt
  *            @arg SDIO_IT_TXUNDERR: Transmit FIFO underrun error interrupt
  *            @arg SDIO_IT_RXOVERR:  Received FIFO overrun error interrupt
  *            @arg SDIO_IT_CMDREND:  Command response received (CRC check passed) interrupt
  *            @arg SDIO_IT_CMDSENT:  Command sent (no response required) interrupt
  *            @arg SDIO_IT_DATAEND:  Data end (data counter, DATACOUNT, is zero) interrupt
  *            @arg SDIO_IT_DBCKEND:  Data block sent/received (CRC check passed) interrupt
  *            @arg SDIO_IT_CMDACT:   Command transfer in progress interrupt
  *            @arg SDIO_IT_TXACT:    Data transmit in progress interrupt
  *            @arg SDIO_IT_RXACT:    Data receive in progress interrupt
  *            @arg SDIO_IT_TXFIFOHE: Transmit FIFO Half Empty interrupt
  *            @arg SDIO_IT_RXFIFOHF: Receive FIFO Half Full interrupt
  *            @arg SDIO_IT_TXFIFOF:  Transmit FIFO full interrupt
  *            @arg SDIO_IT_RXFIFOF:  Receive FIFO full interrupt
  *            @arg SDIO_IT_TXFIFOE:  Transmit FIFO empty interrupt
  *            @arg SDIO_IT_RXFIFOE:  Receive FIFO empty interrupt
  *            @arg SDIO_IT_TXDAVL:   Data available in transmit FIFO interrupt
  *            @arg SDIO_IT_RXDAVL:   Data available in receive FIFO interrupt
  *            @arg SDIO_IT_SDIOIT:   SDIO interrupt received interrupt
  * @retval The new state of SDIO_IT (SET or RESET).
  */
#define __SDIO_GET_IT  (__INSTANCE__, __INTERRUPT__)  (((__INSTANCE__)->STA &(__INTERRUPT__)) == (__INTERRUPT__))


/**
  * @brief  Enable CMD pullup.
  * @retval None
  */    
#define __SDIO_OD_PULLUP_ENABLE(__INSTANCE__)    SET_BIT((__INSTANCE__)->CTRL, SDIO_CTRL_ODPUEN)
  
/**
  * @brief  Disable CMD pullup.
  * @retval None
  */    
#define __SDIO_OD_PULLUP_DISABLE(__INSTANCE__)    CLEAR_BIT((__INSTANCE__)->CTRL, SDIO_CTRL_ODPUEN)
  
/**
  * @brief  Enables the SDIO card to suspend queues.
  * @retval None
  */    
#define __SDIO_PEND_QUEUSE()         SET_BIT(SDIO->CTRL, SDIO_CTRL_ABORTRD)

/**
  * @brief  Send automatic IRQ response.
  * @retval None
  */    
#define __SDIO_SEND_IRQ()            SET_BIT(SDIO->CTRL, SDIO_CTRL_AUTOIRQRESP)

/**
  * @brief  Send read wait to SDIO card
  * @retval None
  */    
#define __SDIO_SEND_READ_WAIT()      SET_BIT(SDIO->CTRL, SDIO_CTRL_READWAIT)

/**
  * @brief  Reset FIFO
  * @retval None
  */    
#define __SDIO_FIFO_RESET()      SET_BIT(SDIO->CTRL, SDIO_CTRL_FIFORST)

/**
  * @brief  Reset SDIO controller
  * @retval None
  */    
#define __SDIO_CONTR_RESET()      SET_BIT(SDIO->CTRL, SDIO_CTRL_SDIORST)

/**
  * @brief  Send CCSD to CE-ATA.
  * @retval None
  */    
#define __SDIO_CEATA_SEND_CCSD()    SET_BIT(SDIO->CTRL, SDIO_CTRL_CCSDEN)
  
/**
  * @brief  Automatically send STOP after sending CCSD to CE-ATA.
  * @retval None
  */    
#define __SDIO_CEATA_SEND_STOP()    SET_BIT(SDIO->CTRL, SDIO_CTRL_AUTOSTOPCCSD)

/**
  * @brief  Enable the CE-ATA device interrupt.
  * @retval None
  */    
#define __SDIO_CEATA_DEVICE_ENABLE_IT()    SET_BIT(SDIO->CTRL, SDIO_CTRL_CEATAINTEN)

/**
  * @brief  Disable the CE-ATA device interrupt.
  * @retval None
  */  
#define __SDIO_CEATA_DEVICE_DISABLE_IT()   CLEAR_BIT(SDIO->CTRL, SDIO_CTRL_CEATAINTEN)

/**
  * @brief  Enable the CE-ATA interrupt.
  * @retval None
  */    
#define __SDIO_CEATA_ENABLE_IT()    SET_BIT(SDIO->CMD, SDIO_CMD_IEN)

/**
  * @brief  Disable the CE-ATA interrupt.
  * @retval None
  */  
#define __SDIO_CEATA_DISABLE_IT()   CLEAR_BIT(SDIO->CMD, SDIO_CMD_IEN)

/**
  * @brief  Enable send CE-ATA command (CMD61).
  * @retval None
  */  
#define __SDIO_CEATA_SENDCMD_ENABLE()   SET_BIT(SDIO->CMD, SDIO_CMD_STARTCMD)

/**
  * @brief  Disable send CE-ATA command (CMD61).
  * @retval None
  */  
#define __SDIO_CEATA_SENDCMD_DISABLE()   CLEAR_BIT(SDIO->CMD, SDIO_CMD_STARTCMD)

/**
  * @brief  Force start operation.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_MODE_FORCE()   SET_BIT(SDIO->CMD, SDIO_CMD_BOOTMODE)

/**
  * @brief  Backup startup operation.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_MODE_BACKUP()   CLEAR_BIT(SDIO->CMD, SDIO_CMD_BOOTMODE)

/**
  * @brief  Enable boot startup.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_ENABLE()   MODIFY_REG(SDIO->CMD, (SDIO_CMD_BOOTEN| SDIO_CMD_BOOTDIS), \
                                                          (SDIO_CMD_BOOTEN| ~SDIO_CMD_BOOTDIS))

/**
  * @brief  Disable boot startup.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_DISABLE()   MODIFY_REG(SDIO->CMD, (SDIO_CMD_BOOTEN| SDIO_CMD_BOOTDIS), \
                                                           (~SDIO_CMD_BOOTEN| SDIO_CMD_BOOTDIS))

/**
  * @brief  Reset boot startup.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_RESET()   CLEAR_BIT(SDIO->CMD,(SDIO_CMD_BOOTEN| SDIO_CMD_BOOTDIS))

/**
  * @brief  Expect boot ack ensable.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_ACK_ENABLE()   SET_BIT(SDIO->CMD, SDIO_CMD_BOOTMODE)

/**
  * @brief  Expect boot ack disable.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_ACK_DISABLE()   CLEAR_BIT(SDIO->CMD, SDIO_CMD_BOOTMODE)
/**
  * @}
  */
   
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup SDMMC_LL_Exported_Functions
  * @{
  */
  
/* Initialization/de-initialization functions  **********************************/
/** @addtogroup HAL_SDMMC_LL_Group1
  * @{
  */
HAL_StatusTypeDef SDIO_Init(SDIO_TypeDef *SDIOx, SDIO_InitTypeDef Init);
void SDIO_ClockEnable(SDIO_TypeDef *SDIOx);
void SDIO_ClockDisable(SDIO_TypeDef *SDIOx);
void SDIO_SetClock(SDIO_TypeDef *SDIOx,uint32_t SDIO_ClkDiv);
/**
  * @}
  */
  
/* I/O operation functions  *****************************************************/
/** @addtogroup HAL_SDMMC_LL_Group2
  * @{
  */
uint32_t SDIO_ReadFIFO(SDIO_TypeDef *SDIOx);
HAL_StatusTypeDef SDIO_WriteFIFO(SDIO_TypeDef *SDIOx, uint32_t *pWriteData);
/**
  * @}
  */
  
/* Peripheral Control functions  ************************************************/
/** @addtogroup HAL_SDMMC_LL_Group3
  * @{
  */
HAL_StatusTypeDef SDIO_PowerState_ON(SDIO_TypeDef *SDIOx);
HAL_StatusTypeDef SDIO_PowerState_OFF(SDIO_TypeDef *SDIOx);
uint32_t SDIO_GetPowerState(SDIO_TypeDef *SDIOx);
HAL_StatusTypeDef SDIO_SendCommand(SDIO_TypeDef *SDIOx, SDIO_CmdInitTypeDef *Command);
uint8_t SDIO_GetCommandResponse(SDIO_TypeDef *SDIOx);
uint32_t SDIO_GetResponse(SDIO_TypeDef *SDIOx, uint32_t Response);
HAL_StatusTypeDef SDIO_ConfigData(SDIO_TypeDef *SDIOx, SDIO_DataInitTypeDef* Data);
uint32_t SDIO_GetFIFOCount(SDIO_TypeDef *SDIOx);
HAL_StatusTypeDef SDIO_SetFifoThreshold(SDIO_TypeDef *SDIOx, uint32_t RxWatermark, uint32_t TxWatermark);
/**
  * @}
  */

